## 794722365809: Satellite bucket
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.s3_replicate will be created
  + resource "aws_iam_policy" "s3_replicate" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CbsSatelliteReplicateToLogArchive"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetReplicationConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-794722365809"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:GetObjectVersionAcl",
                          + "s3:GetObjectVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-794722365809/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:ReplicateObject",
                          + "s3:ReplicateDelete",
                          + "s3:ObjectOwnerOverrideToBucketOwner",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-log-archive-871282759583/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.s3_replicate will be created
  + resource "aws_iam_role_policy_attachment" "s3_replicate" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CbsSatelliteReplicateToLogArchive"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.s3_replicate"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
